{
  "architectures": [
    "Qwen2MoeForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "decoder_sparse_step": 1,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 5632,
  "max_position_embeddings": 32768,
  "max_window_layers": 21,
  "model_type": "qwen2_moe",
  "moe_intermediate_size": 1408,
  "norm_topk_prob": false,
  "num_attention_heads": 16,
  "num_experts": 60,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 24,
  "num_key_value_heads": 16,
  "output_router_logits": false,
  "quantization_config": {
    "batch_size": 1,
    "bits": 4,
    "block_name_to_quantize": null,
    "cache_block_outputs": true,
    "damp_percent": 0.01,
    "dataset": null,
    "desc_act": false,
    "exllama_config": {
      "version": 2
    },
    "group_size": 128,
    "max_input_length": null,
    "model_seqlen": null,
    "module_name_preceding_first_block": null,
    "modules_in_block_to_quantize": [
      [
        "self_attn.k_proj",
        "self_attn.v_proj",
        "self_attn.q_proj"
      ],
      [
        "self_attn.o_proj"
      ],
      [
        "mlp.shared_expert.up_proj",
        "mlp.shared_expert.gate_proj"
      ],
      [
        "mlp.shared_expert.down_proj"
      ],
      [
        "mlp.experts.0.up_proj",
        "mlp.experts.1.up_proj",
        "mlp.experts.2.up_proj",
        "mlp.experts.3.up_proj",
        "mlp.experts.4.up_proj",
        "mlp.experts.5.up_proj",
        "mlp.experts.6.up_proj",
        "mlp.experts.7.up_proj",
        "mlp.experts.8.up_proj",
        "mlp.experts.9.up_proj",
        "mlp.experts.10.up_proj",
        "mlp.experts.11.up_proj",
        "mlp.experts.12.up_proj",
        "mlp.experts.13.up_proj",
        "mlp.experts.14.up_proj",
        "mlp.experts.15.up_proj",
        "mlp.experts.16.up_proj",
        "mlp.experts.17.up_proj",
        "mlp.experts.18.up_proj",
        "mlp.experts.19.up_proj",
        "mlp.experts.20.up_proj",
        "mlp.experts.21.up_proj",
        "mlp.experts.22.up_proj",
        "mlp.experts.23.up_proj",
        "mlp.experts.24.up_proj",
        "mlp.experts.25.up_proj",
        "mlp.experts.26.up_proj",
        "mlp.experts.27.up_proj",
        "mlp.experts.28.up_proj",
        "mlp.experts.29.up_proj",
        "mlp.experts.30.up_proj",
        "mlp.experts.31.up_proj",
        "mlp.experts.32.up_proj",
        "mlp.experts.33.up_proj",
        "mlp.experts.34.up_proj",
        "mlp.experts.35.up_proj",
        "mlp.experts.36.up_proj",
        "mlp.experts.37.up_proj",
        "mlp.experts.38.up_proj",
        "mlp.experts.39.up_proj",
        "mlp.experts.40.up_proj",
        "mlp.experts.41.up_proj",
        "mlp.experts.42.up_proj",
        "mlp.experts.43.up_proj",
        "mlp.experts.44.up_proj",
        "mlp.experts.45.up_proj",
        "mlp.experts.46.up_proj",
        "mlp.experts.47.up_proj",
        "mlp.experts.48.up_proj",
        "mlp.experts.49.up_proj",
        "mlp.experts.50.up_proj",
        "mlp.experts.51.up_proj",
        "mlp.experts.52.up_proj",
        "mlp.experts.53.up_proj",
        "mlp.experts.54.up_proj",
        "mlp.experts.55.up_proj",
        "mlp.experts.56.up_proj",
        "mlp.experts.57.up_proj",
        "mlp.experts.58.up_proj",
        "mlp.experts.59.up_proj",
        "mlp.experts.0.gate_proj",
        "mlp.experts.1.gate_proj",
        "mlp.experts.2.gate_proj",
        "mlp.experts.3.gate_proj",
        "mlp.experts.4.gate_proj",
        "mlp.experts.5.gate_proj",
        "mlp.experts.6.gate_proj",
        "mlp.experts.7.gate_proj",
        "mlp.experts.8.gate_proj",
        "mlp.experts.9.gate_proj",
        "mlp.experts.10.gate_proj",
        "mlp.experts.11.gate_proj",
        "mlp.experts.12.gate_proj",
        "mlp.experts.13.gate_proj",
        "mlp.experts.14.gate_proj",
        "mlp.experts.15.gate_proj",
        "mlp.experts.16.gate_proj",
        "mlp.experts.17.gate_proj",
        "mlp.experts.18.gate_proj",
        "mlp.experts.19.gate_proj",
        "mlp.experts.20.gate_proj",
        "mlp.experts.21.gate_proj",
        "mlp.experts.22.gate_proj",
        "mlp.experts.23.gate_proj",
        "mlp.experts.24.gate_proj",
        "mlp.experts.25.gate_proj",
        "mlp.experts.26.gate_proj",
        "mlp.experts.27.gate_proj",
        "mlp.experts.28.gate_proj",
        "mlp.experts.29.gate_proj",
        "mlp.experts.30.gate_proj",
        "mlp.experts.31.gate_proj",
        "mlp.experts.32.gate_proj",
        "mlp.experts.33.gate_proj",
        "mlp.experts.34.gate_proj",
        "mlp.experts.35.gate_proj",
        "mlp.experts.36.gate_proj",
        "mlp.experts.37.gate_proj",
        "mlp.experts.38.gate_proj",
        "mlp.experts.39.gate_proj",
        "mlp.experts.40.gate_proj",
        "mlp.experts.41.gate_proj",
        "mlp.experts.42.gate_proj",
        "mlp.experts.43.gate_proj",
        "mlp.experts.44.gate_proj",
        "mlp.experts.45.gate_proj",
        "mlp.experts.46.gate_proj",
        "mlp.experts.47.gate_proj",
        "mlp.experts.48.gate_proj",
        "mlp.experts.49.gate_proj",
        "mlp.experts.50.gate_proj",
        "mlp.experts.51.gate_proj",
        "mlp.experts.52.gate_proj",
        "mlp.experts.53.gate_proj",
        "mlp.experts.54.gate_proj",
        "mlp.experts.55.gate_proj",
        "mlp.experts.56.gate_proj",
        "mlp.experts.57.gate_proj",
        "mlp.experts.58.gate_proj",
        "mlp.experts.59.gate_proj"
      ],
      [
        "mlp.experts.0.down_proj",
        "mlp.experts.1.down_proj",
        "mlp.experts.2.down_proj",
        "mlp.experts.3.down_proj",
        "mlp.experts.4.down_proj",
        "mlp.experts.5.down_proj",
        "mlp.experts.6.down_proj",
        "mlp.experts.7.down_proj",
        "mlp.experts.8.down_proj",
        "mlp.experts.9.down_proj",
        "mlp.experts.10.down_proj",
        "mlp.experts.11.down_proj",
        "mlp.experts.12.down_proj",
        "mlp.experts.13.down_proj",
        "mlp.experts.14.down_proj",
        "mlp.experts.15.down_proj",
        "mlp.experts.16.down_proj",
        "mlp.experts.17.down_proj",
        "mlp.experts.18.down_proj",
        "mlp.experts.19.down_proj",
        "mlp.experts.20.down_proj",
        "mlp.experts.21.down_proj",
        "mlp.experts.22.down_proj",
        "mlp.experts.23.down_proj",
        "mlp.experts.24.down_proj",
        "mlp.experts.25.down_proj",
        "mlp.experts.26.down_proj",
        "mlp.experts.27.down_proj",
        "mlp.experts.28.down_proj",
        "mlp.experts.29.down_proj",
        "mlp.experts.30.down_proj",
        "mlp.experts.31.down_proj",
        "mlp.experts.32.down_proj",
        "mlp.experts.33.down_proj",
        "mlp.experts.34.down_proj",
        "mlp.experts.35.down_proj",
        "mlp.experts.36.down_proj",
        "mlp.experts.37.down_proj",
        "mlp.experts.38.down_proj",
        "mlp.experts.39.down_proj",
        "mlp.experts.40.down_proj",
        "mlp.experts.41.down_proj",
        "mlp.experts.42.down_proj",
        "mlp.experts.43.down_proj",
        "mlp.experts.44.down_proj",
        "mlp.experts.45.down_proj",
        "mlp.experts.46.down_proj",
        "mlp.experts.47.down_proj",
        "mlp.experts.48.down_proj",
        "mlp.experts.49.down_proj",
        "mlp.experts.50.down_proj",
        "mlp.experts.51.down_proj",
        "mlp.experts.52.down_proj",
        "mlp.experts.53.down_proj",
        "mlp.experts.54.down_proj",
        "mlp.experts.55.down_proj",
        "mlp.experts.56.down_proj",
        "mlp.experts.57.down_proj",
        "mlp.experts.58.down_proj",
        "mlp.experts.59.down_proj"
      ]
    ],
    "pad_token_id": null,
    "quant_method": "gptq",
    "sym": true,
    "tokenizer": null,
    "true_sequential": true,
    "use_cuda_fp16": false,
    "use_exllama": true
  },
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.001,
  "shared_expert_intermediate_size": 5632,
  "sliding_window": 32768,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.39.0.dev0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
